colinta/Grayduino/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms

menu.cpu=Processor

##############################################################

grayduino.name=Grayduino
grayduino.vid.0=0x2341
grayduino.pid.0=0x0036
grayduino.vid.1=0x2341
grayduino.pid.1=0x8036
grayduino.vid.2=0x2A03
grayduino.pid.2=0x0036
grayduino.vid.3=0x2A03
grayduino.pid.3=0x8036

grayduino.upload.tool=arduino:avrdude
grayduino.upload.protocol=avr109
grayduino.upload.maximum_size=28672
grayduino.upload.maximum_data_size=2560
grayduino.upload.speed=57600
grayduino.upload.disable_flushing=true
grayduino.upload.use_1200bps_touch=true
grayduino.upload.wait_for_upload_port=true

grayduino.bootloader.tool=arduino:avrdude
grayduino.bootloader.low_fuses=0xff
grayduino.bootloader.high_fuses=0xd8
grayduino.bootloader.extended_fuses=0xcb
grayduino.bootloader.file=Caterina-Leonardo.hex
grayduino.bootloader.unlock_bits=0x3F
grayduino.bootloader.lock_bits=0x2F

grayduino.build.mcu=atmega32u4
grayduino.build.f_cpu=16000000L
grayduino.build.vid=0x2341
grayduino.build.pid=0x8036
grayduino.build.usb_product="Grayduino"
grayduino.build.board=AVR_GRAYDUINO
grayduino.build.core=arduino:arduino
grayduino.build.variant=grayduino
grayduino.build.extra_flags={build.usb_flags}
